<?xml version="1.0" ?>
<net name="rf_FP32" version="10">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data element_type="f32" shape="110,128,1,2"/>
			<output>
				<port id="0" precision="FP32">
					<dim>110</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="sequential_48/conv2d_46/Conv2D/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="256,128,1,3" size="393216"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="sequential_48/conv2d_46/Conv2D" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,2" pads_end="0,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="sequential_48/conv2d_46/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="393216" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="sequential_48/conv2d_46/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="sequential_48/conv2d_46/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>110</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="sequential_48/conv2d_47/Conv2D/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="394240" shape="150,256,1,3" size="460800"/>
			<output>
				<port id="1" precision="FP32">
					<dim>150</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="sequential_48/conv2d_47/Conv2D" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,2" pads_end="0,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>150</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="sequential_48/conv2d_47/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="855040" shape="1,150,1,1" size="600"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="sequential_48/conv2d_47/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="sequential_48/conv2d_47/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>110</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="sequential_48/conv2d_48/Conv2D/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="855640" shape="80,150,1,3" size="144000"/>
			<output>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="sequential_48/conv2d_48/Conv2D" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,2" pads_end="0,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="sequential_48/conv2d_48/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="999640" shape="1,80,1,1" size="320"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="sequential_48/conv2d_48/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="sequential_48/conv2d_48/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>110</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="sequential_48/conv2d_48/Relu/Transpose/Cast_11279_const" type="Const" version="opset1">
			<data element_type="i64" offset="999960" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="sequential_48/conv2d_48/Relu/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="sequential_48/flatten_22/Reshape/Cast_11281_const" type="Const" version="opset1">
			<data element_type="i64" offset="999992" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="sequential_48/flatten_22/Reshape" type="Reshape" version="opset1">
			<data special_zero="False"/>
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="sequential_48/dense_44/MatMul/1_port_transpose1032_const" type="Const" version="opset1">
			<data element_type="f32" offset="1000008" shape="256,640" size="655360"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="sequential_48/dense_44/MatMul" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="sequential_48/dense_44/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1655368" shape="1,256" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="sequential_48/dense_44/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="sequential_48/dense_44/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>110</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="sequential_48/dense_45/MatMul/1_port_transpose1036_const" type="Const" version="opset1">
			<data element_type="f32" offset="1656392" shape="11,256" size="11264"/>
			<output>
				<port id="1" precision="FP32">
					<dim>11</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="sequential_48/dense_45/MatMul" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>11</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="sequential_48/dense_45/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1667656" shape="1,11" size="44"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="sequential_48/dense_45/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>11</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>110</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Identity/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>110</dim>
					<dim>11</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1"/>
		<edge from-layer="7" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="1"/>
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="1"/>
		<edge from-layer="17" from-port="2" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="21" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="21" to-port="1"/>
		<edge from-layer="21" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="22" from-port="1" to-layer="23" to-port="1"/>
		<edge from-layer="23" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="1"/>
		<edge from-layer="26" from-port="2" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="29" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value=""/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<data_type value="FP32"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="False"/>
			<generate_experimental_IR_V10 value="True"/>
			<input_model value="DIR/rftry3.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[110,1,2,128]"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="rf_FP32"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[110   1   2 128]"/>
			<progress value="False"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, output, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
